package main

import "fmt"

func main() {
	str := "生活的枪手博弈论\n\n生活就像一场博弈，而生命则是赌注。无论你处于哪个阶段，生活总是在不同程度上测试你的决策能力和对未来的预测能力。在这个博弈中，你需要不断地思考和行动，以最大化你的收益，同时最小化你的损失。\n\n枪手博弈论是博弈论中的一种模型，它描述了两个枪手在互相瞄准的情况下，谁会先开枪。将这一模型运用到生活中，我们可以看到许多决策都有类似的特征。如何在不确定的环境中进行最佳选择，是我们需要思考的主题。\n\n1. 了解自己的价值观\n\n在生活的枪手博弈论中，我们需要首先了解自己的价值观。你的价值观是你做出决策的基础，它指导你的选择和行动。如果你的价值观是模棱两可的，你就会欠缺决断力和自信心，而这往往会带来更多的困扰。\n\n例如，当你需要面对生命中的重大决策时，如事业发展、婚姻和家庭，你需要明确自己对这些问题的态度和信念。只有这样，你才能根据自己的价值观，做出最合适的选择。\n\n2. 确定目标和优先级\n\n在生活的枪手博弈论中，我们需要明确自己的目标和优先级。这可以帮助我们决定我们的选择，从而做出更明智的决策。在决策时，我们需要将注意力集中在那些最重要的目标上，将我们的时间、精力和资源投入到那些最有价值的事情上。\n\n例如，当你需要在工作和家庭之间做出选择时，你需要优先考虑哪个目标更重要。如果你的主要目标是家庭，你可能会更倾向于选择一个较为灵活的工作时间表和较少的工作压力；如果你的主要目标是事业，你可能会更愿意在工作上花费更多的时间和精力。\n\n3. 计算风险和回报\n\n在生活的枪手博弈论中，我们需要计算风险和回报。我们需要考虑每个选择的风险和可能的结果，以确定哪种\n"
	//str2 := "选择会给我们带来最高的回报。如果我们只关注可能的回报，而不考虑潜在的风险，那么我们的决策可能会导致糟糕的后果。\n\n例如，当你需要决定是否要买一套房子时，你需要考虑许多因素，如房屋价格、房贷利率、收入和预期升值率等。你需要权衡风险和回报，以找到最佳的决策方案。\n\n4. 掌握博弈技巧\n\n在生活的枪手博弈论中，我们需要学会掌握博弈技巧。这意味着我们需要了解对手的行为和策略，并尝试预测他们可能的动作。同时，我们还需要尽量减少我们的信息泄露，以保护我们的利益。\n\n例如，当你需要谈判一个重要合同时，你需要了解对方的诉求和目标，并尝试通过自己的策略和技巧来获得优势。同时，你还需要注意不要放弃过多的信息，以保持自己的筹码。"
	str2 := "【未完待续，回复任意文字以继续】"

	fmt.Println(len([]rune(str)))
	fmt.Println(len([]rune(str2)))
	fmt.Println(2900 / 650)
}
